Enums/упТипыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Водитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительЭкспедитор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Курьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Механик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспедитор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыСотрудников/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокСсылок = Новый СписокЗначений;
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Водитель);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.ВодительЭкспедитор);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Врач);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Курьер);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Логист);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Механик);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Оператор);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Прочее);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Экспедитор);
	Если ПолучитьФункциональнуюОпцию("упВедетсяРаботаЧерезТорговыхПредставителей") Тогда
		СписокСсылок.Добавить(Перечисления.упТипыСотрудников.ТорговыйПредставитель);
	КонецЕсли;
	СписокИсключений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТипыСотрудников.Ссылка
	|ИЗ
	|	Перечисление.упТипыСотрудников КАК ТипыСотрудников
	|ГДЕ
	|	ТипыСотрудников.Ссылка В(&Список)
	|	И НЕ ТипыСотрудников.Ссылка В (&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыСотрудников.Порядок";
	Запрос.УстановитьПараметр("Список",           СписокСсылок);
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
